
*** Problem 4
Write a python program that calculates the average of my_array in a variable called my_array_average using numpy.

#+begin_src python :results output
import numpy as np

# Define your array here
my_array = np.array([1, 2, 3, 4, 5])

# Calculate the average using numpy.mean
my_array_average = np.mean(my_array)

# Print the average
print(f"The average of my_array is: {my_array_average}")
#+end_src

#+RESULTS:
: The average of my_array is: 3.0
